Revit 2024 API
EdgeArray.Append Method
Add the edge to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	Edge item
)
Visual Basic
Public Overridable Sub Append ( _
	item As Edge _
)
Visual C++
public:
virtual void Append(
	Edge^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Edge
The edge to be added.
See Also
EdgeArray Class
Autodesk.Revit.DB Namespace